app/views/projects/_form.html.erb

                <%= f.label :Status, class: "control-label" %>
                <%= task_field.select :task_status, Task.task_statuses.keys, {}, class: 'form-control' %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 3]]