app/views/projects/show.html.erb

        <div class="card" style="margin-top: 5%;">
          <% if @project.tasks.present? %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 3]]

                  <% @project.tasks.reverse.each_with_index do |row, sr_no| %>
                    <% if row.project.present? %>
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]