app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "description", "task_status", "task_date", "project_id", "user_id", "created_at", "updated_at", "priority") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    # @task = @project.tasks.new()
    @task = Task.new(task_params)
    respond_to do |format|
      if @task.save

DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 4]]
UPDATE "tasks" SET "task_status" = $1, "priority" = $2, "task_date" = $3, "updated_at" = $4 WHERE "tasks"."id" = $5  [["task_status", 1], ["priority", 1], ["task_date", "2020-03-01"], ["updated_at", "2020-03-01 20:38:41.382988"], ["id", 17]]
---
  def update
    task_status = "task_status_#{@task.id}"
    if Rails.cache.exist?(task_status)
      Rails.cache.delete(task_status)
    end
    Rails.cache.write(task_status, @task)
    respond_to do |format|
      if @task.update(task_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 47], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_project
    if params[:id]
      @project = Project.find_by(id: params[:id])
    else
      @project = Project.find_by(id: params[:project_id])